# Data Analyst Challenge

Author: Andres Restrepo

## Libraries

In [1]:
#pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.9-cp37-cp37m-win_amd64.whl (1.2 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.9
Note: you may need to restart the kernel to use updated packages.

In [1]:
import psycopg2
import pandas as pd

# Connecting to PostgreSQL

In [2]:
# Connection parameters
hostname = 'localhost'
username = 'postgres'
password = 'Evolucion.2024'
database = 'ces_usa'

# Establish connection
connection = psycopg2.connect(
    host=hostname,
    user=username,
    password=password,
    dbname=database
)

## Reading Government data

In [3]:
# Define SQL query
query_gov = "SELECT * FROM nimble.ce_data_90a;"

# Execute query and fetch data into a pandas DataFrame
df_gov = pd.read_sql_query(query_gov, connection)

In [4]:
df_gov.dtypes

series_id         object
year               int64
period            object
value              int64
footnote_codes    object
dtype: object

In [5]:
df_gov.head()

           series_id  year period  value footnote_codes
0  CES9000000001      1939    M01   3988           None
1  CES9000000001      1939    M02   4001           None
2  CES9000000001      1939    M03   4002           None
3  CES9000000001      1939    M04   4002           None
4  CES9000000001      1939    M05   4006           None

In [6]:
df_gov.tail()

               series_id  year period  value footnote_codes
58434  CEU9093299910      2023    M09   6222           None
58435  CEU9093299910      2023    M10   6196           None
58436  CEU9093299910      2023    M11   6190           None
58437  CEU9093299910      2023    M12   6207              P
58438  CEU9093299910      2023    M13   6214              P

In [7]:
#df_gov.columns

Index(['series_id', 'year', 'period', 'value', 'footnote_codes'], dtype='object')

In [8]:
df_gov['series_id'].unique()

array(['CES9000000001    ', 'CES9000000010    ', 'CES9091000001    ',
       'CES9091000010    ', 'CES9091100001    ', 'CES9091100010    ',
       'CES9091622001    ', 'CES9091622010    ', 'CES9091911001    ',
       'CES9091911010    ', 'CES9091912001    ', 'CES9091912010    ',
       'CES9091999901    ', 'CES9091999910    ', 'CES9092000001    ',
       'CES9092000010    ', 'CES9092161101    ', 'CES9092161110    ',
       'CES9092200001    ', 'CES9092200010    ', 'CES9092262201    ',
       'CES9092262210    ', 'CES9092292001    ', 'CES9092292010    ',
       'CES9092299901    ', 'CES9092299910    ', 'CES9093000001    ',
       'CES9093000010    ', 'CES9093161101    ', 'CES9093161110    ',
       'CES9093200001    ', 'CES9093200010    ', 'CES9093222101    ',
       'CES9093222110    ', 'CES9093248001    ', 'CES9093248010    ',
       'CES9093262201    ', 'CES9093262210    ', 'CES9093292001    ',
       'CES9093292010    ', 'CES9093299901    ', 'CES9093299910    ',
       'CEU9000000001    ', 'CEU9000000010    ', 'CEU9091000001    ',
       'CEU9091000010    ', 'CEU9091100001    ', 'CEU9091100010    ',
       'CEU9091622001    ', 'CEU9091622010    ', 'CEU9091911001    ',
       'CEU9091911010    ', 'CEU9091912001    ', 'CEU9091912010    ',
       'CEU9091999901    ', 'CEU9091999910    ', 'CEU9092000001    ',
       'CEU9092000010    ', 'CEU9092161101    ', 'CEU9092161110    ',
       'CEU9092200001    ', 'CEU9092200010    ', 'CEU9092262201    ',
       'CEU9092262210    ', 'CEU9092292001    ', 'CEU9092292010    ',
       'CEU9092299901    ', 'CEU9092299910    ', 'CEU9093000001    ',
       'CEU9093000010    ', 'CEU9093161101    ', 'CEU9093161110    ',
       'CEU9093200001    ', 'CEU9093200010    ', 'CEU9093222101    ',
       'CEU9093222110    ', 'CEU9093248001    ', 'CEU9093248010    ',
       'CEU9093262201    ', 'CEU9093262210    ', 'CEU9093292001    ',
       'CEU9093292010    ', 'CEU9093299901    ', 'CEU9093299910    '],
      dtype=object)

__There were blank spaces in series_id__

### Data cleaning

In [9]:
df_gov['series_id'] = df_gov['series_id'].str.strip()

In [10]:
df_gov['series_id'].unique()

array(['CES9000000001', 'CES9000000010', 'CES9091000001', 'CES9091000010',
       'CES9091100001', 'CES9091100010', 'CES9091622001', 'CES9091622010',
       'CES9091911001', 'CES9091911010', 'CES9091912001', 'CES9091912010',
       'CES9091999901', 'CES9091999910', 'CES9092000001', 'CES9092000010',
       'CES9092161101', 'CES9092161110', 'CES9092200001', 'CES9092200010',
       'CES9092262201', 'CES9092262210', 'CES9092292001', 'CES9092292010',
       'CES9092299901', 'CES9092299910', 'CES9093000001', 'CES9093000010',
       'CES9093161101', 'CES9093161110', 'CES9093200001', 'CES9093200010',
       'CES9093222101', 'CES9093222110', 'CES9093248001', 'CES9093248010',
       'CES9093262201', 'CES9093262210', 'CES9093292001', 'CES9093292010',
       'CES9093299901', 'CES9093299910', 'CEU9000000001', 'CEU9000000010',
       'CEU9091000001', 'CEU9091000010', 'CEU9091100001', 'CEU9091100010',
       'CEU9091622001', 'CEU9091622010', 'CEU9091911001', 'CEU9091911010',
       'CEU9091912001', 'CEU9091912010', 'CEU9091999901', 'CEU9091999910',
       'CEU9092000001', 'CEU9092000010', 'CEU9092161101', 'CEU9092161110',
       'CEU9092200001', 'CEU9092200010', 'CEU9092262201', 'CEU9092262210',
       'CEU9092292001', 'CEU9092292010', 'CEU9092299901', 'CEU9092299910',
       'CEU9093000001', 'CEU9093000010', 'CEU9093161101', 'CEU9093161110',
       'CEU9093200001', 'CEU9093200010', 'CEU9093222101', 'CEU9093222110',
       'CEU9093248001', 'CEU9093248010', 'CEU9093262201', 'CEU9093262210',
       'CEU9093292001', 'CEU9093292010', 'CEU9093299901', 'CEU9093299910'],
      dtype=object)

### Subsetting

In [11]:
# Subsetting series of interest
# CEU9000000001: All employees, thousands, government, not seasonally adjusted
# CEU9000000010: Women employees, thousands, government, not seasonally adjusted
gov_series = ("CEU9000000001","CEU9000000010")
# df_gov_sub = df_gov[(df_gov.series_id == "CEU9000000001")]
df_gov_sub = df_gov[df_gov['series_id'].isin(gov_series)]

In [12]:
df_gov_sub.head

<bound method NDFrame.head of            series_id  year period  value footnote_codes
28053  CEU9000000001  1939    M01   3958           None
28054  CEU9000000001  1939    M02   3947           None
28055  CEU9000000001  1939    M03   3971           None
28056  CEU9000000001  1939    M04   3985           None
28057  CEU9000000001  1939    M05   4032           None
...              ...   ...    ...    ...            ...
29935  CEU9000000010  2023    M10  13643           None
29936  CEU9000000010  2023    M11  13756           None
29937  CEU9000000010  2023    M12  13698              P
29938  CEU9000000010  2023    M13  13285              P
29939  CEU9000000010  2024    M01  13470              P

[1887 rows x 5 columns]>

In [13]:
df_gov_sub['series_id'].unique()

array(['CEU9000000001', 'CEU9000000010'], dtype=object)

## Reading production and supervisory employees data

In [35]:
# Define SQL query
query_pro_sup = "SELECT * FROM nimble.ce_data_05a;"

# Execute query and fetch data into a pandas DataFrame
df_pro_sup = pd.read_sql_query(query_pro_sup, connection)

In [36]:
df_pro_sup.head()

           series_id  year period  value footnote_codes
0  CES0500000001      1939    M01  25935           None
1  CES0500000001      1939    M02  26099           None
2  CES0500000001      1939    M03  26278           None
3  CES0500000001      1939    M04  26092           None
4  CES0500000001      1939    M05  26293           None

In [37]:
df_pro_sup.tail()

               series_id  year period  value footnote_codes
23068  CEU0800000010      2023    M10  60027           None
23069  CEU0800000010      2023    M11  60282           None
23070  CEU0800000010      2023    M12  60354              P
23071  CEU0800000010      2023    M13  59464              P
23072  CEU0800000010      2024    M01  59435              P

In [38]:
df_pro_sup['series_id'].unique()

array(['CES0500000001    ', 'CES0500000006    ', 'CES0500000010    ',
       'CES0500000021    ', 'CES0500000022    ', 'CES0500000023    ',
       'CES0500000025    ', 'CES0500000026    ', 'CES0600000001    ',
       'CES0600000006    ', 'CES0600000010    ', 'CES0600000025    ',
       'CES0700000001    ', 'CES0700000010    ', 'CES0700000025    ',
       'CES0800000001    ', 'CES0800000006    ', 'CES0800000010    ',
       'CEU0500000001    ', 'CEU0500000006    ', 'CEU0500000010    ',
       'CEU0500000024    ', 'CEU0600000001    ', 'CEU0600000006    ',
       'CEU0600000010    ', 'CEU0700000001    ', 'CEU0700000010    ',
       'CEU0800000001    ', 'CEU0800000006    ', 'CEU0800000010    '],
      dtype=object)

__There were blank spaces in series_id__

### Data cleaning

In [39]:
df_pro_sup['series_id'] = df_pro_sup['series_id'].str.strip()

In [40]:
df_pro_sup['series_id'].unique()

array(['CES0500000001', 'CES0500000006', 'CES0500000010', 'CES0500000021',
       'CES0500000022', 'CES0500000023', 'CES0500000025', 'CES0500000026',
       'CES0600000001', 'CES0600000006', 'CES0600000010', 'CES0600000025',
       'CES0700000001', 'CES0700000010', 'CES0700000025', 'CES0800000001',
       'CES0800000006', 'CES0800000010', 'CEU0500000001', 'CEU0500000006',
       'CEU0500000010', 'CEU0500000024', 'CEU0600000001', 'CEU0600000006',
       'CEU0600000010', 'CEU0700000001', 'CEU0700000010', 'CEU0800000001',
       'CEU0800000006', 'CEU0800000010'], dtype=object)

### Subsetting

In [41]:
# Subsetting series of interest
# CEU0500000006: Production and nonsupervisory employees, thousands, total private, not seasonally adjusted
pro_sup_series = ("CEU0500000006", "CEU0500000001")
# df_pro_sup = df_pro_sup[(df_pro_sup.series_id == "CEU0500000006")]
df_pro_sup = df_pro_sup[df_pro_sup['series_id'].isin(pro_sup_series)]

In [42]:
df_pro_sup.head

<bound method NDFrame.head of            series_id  year period   value footnote_codes
12564  CEU0500000001  1939    M01   25338           None
12565  CEU0500000001  1939    M02   25447           None
12566  CEU0500000001  1939    M03   25833           None
12567  CEU0500000001  1939    M04   25801           None
12568  CEU0500000001  1939    M05   26113           None
...              ...   ...    ...     ...            ...
14446  CEU0500000006  2023    M10  109513           None
14447  CEU0500000006  2023    M11  109887           None
14448  CEU0500000006  2023    M12  109756              P
14449  CEU0500000006  2023    M13  108425              P
14450  CEU0500000006  2024    M01  107767              P

[1887 rows x 5 columns]>

In [43]:
df_pro_sup['series_id'].unique()

array(['CEU0500000001', 'CEU0500000006'], dtype=object)

# Transforming data

## Month

In [44]:
# Month listing
month_mapping = {
    'M01': 'January',
    'M02': 'February',
    'M03': 'March',
    'M04': 'April',
    'M05': 'May',
    'M06': 'June',
    'M07': 'July',
    'M08': 'August',
    'M09': 'September',
    'M10': 'October',
    'M11': 'November',
    'M12': 'December'
}

df_gov['month'] = df_gov['period'].map(month_mapping)
df_pro_sup['month'] = df_pro_sup['period'].map(month_mapping)

In [45]:
df_gov.head()

,series_id,year,period,valueInThousands,footnote_codes,month,year_str,date
0,CES9000000001,1939,M01,3988,None,January,1939,January 1939
1,CES9000000001,1939,M02,4001,None,February,1939,February 1939
2,CES9000000001,1939,M03,4002,None,March,1939,March 1939
3,CES9000000001,1939,M04,4002,None,April,1939,April 1939
4,CES9000000001,1939,M05,4006,None,May,1939,May 1939

In [46]:
df_pro_sup.head()

           series_id  year period  value footnote_codes     month
12564  CEU0500000001  1939    M01  25338           None   January
12565  CEU0500000001  1939    M02  25447           None  February
12566  CEU0500000001  1939    M03  25833           None     March
12567  CEU0500000001  1939    M04  25801           None     April
12568  CEU0500000001  1939    M05  26113           None       May

## Month year date column

In [47]:
# String year column
df_gov['year_str'] = df_gov['year'].astype(str)
df_pro_sup['year_str'] = df_pro_sup['year'].astype(str)
# Merging month and year columns
df_gov['date'] = df_gov['month'] + ' ' + df_gov['year_str']
df_pro_sup['date'] = df_pro_sup['month'] + ' ' + df_pro_sup['year_str']

In [48]:
df_gov.head()

,series_id,year,period,valueInThousands,footnote_codes,month,year_str,date
0,CES9000000001,1939,M01,3988,None,January,1939,January 1939
1,CES9000000001,1939,M02,4001,None,February,1939,February 1939
2,CES9000000001,1939,M03,4002,None,March,1939,March 1939
3,CES9000000001,1939,M04,4002,None,April,1939,April 1939
4,CES9000000001,1939,M05,4006,None,May,1939,May 1939

In [49]:
df_pro_sup.head()

,series_id,year,period,value,footnote_codes,month,year_str,date
12564,CEU0500000001,1939,M01,25338,None,January,1939,January 1939
12565,CEU0500000001,1939,M02,25447,None,February,1939,February 1939
12566,CEU0500000001,1939,M03,25833,None,March,1939,March 1939
12567,CEU0500000001,1939,M04,25801,None,April,1939,April 1939
12568,CEU0500000001,1939,M05,26113,None,May,1939,May 1939

## Value in thousends column

In [50]:
# Rename value column
df_gov = df_gov.rename(columns={'value': 'valueInThousands'})
df_pro_sup = df_pro_sup.rename(columns={'value': 'valueInThousands'})

In [51]:
df_gov.head()

,series_id,year,period,valueInThousands,footnote_codes,month,year_str,date
0,CES9000000001,1939,M01,3988,None,January,1939,January 1939
1,CES9000000001,1939,M02,4001,None,February,1939,February 1939
2,CES9000000001,1939,M03,4002,None,March,1939,March 1939
3,CES9000000001,1939,M04,4002,None,April,1939,April 1939
4,CES9000000001,1939,M05,4006,None,May,1939,May 1939

In [52]:
df_pro_sup.head()

,series_id,year,period,valueInThousands,footnote_codes,month,year_str,date
12564,CEU0500000001,1939,M01,25338,None,January,1939,January 1939
12565,CEU0500000001,1939,M02,25447,None,February,1939,February 1939
12566,CEU0500000001,1939,M03,25833,None,March,1939,March 1939
12567,CEU0500000001,1939,M04,25801,None,April,1939,April 1939
12568,CEU0500000001,1939,M05,26113,None,May,1939,May 1939